{
	"format": "layers-model",
	"generatedBy": "keras v2.12.0",
	"convertedBy": "TensorFlow.js Converter v4.4.0",
	"modelTopology": {
		"keras_version": "2.12.0",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Sequential",
			"config": {
				"name": "sequential",
				"layers": [
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [null, null],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "embedding_input"
						}
					},
					{
						"class_name": "Embedding",
						"config": {
							"name": "embedding",
							"trainable": true,
							"dtype": "float32",
							"batch_input_shape": [null, null],
							"input_dim": 10001,
							"output_dim": 16,
							"embeddings_initializer": {
								"class_name": "RandomUniform",
								"config": { "minval": -0.05, "maxval": 0.05, "seed": null }
							},
							"embeddings_regularizer": null,
							"activity_regularizer": null,
							"embeddings_constraint": null,
							"mask_zero": false,
							"input_length": null
						}
					},
					{
						"class_name": "Dropout",
						"config": {
							"name": "dropout",
							"trainable": true,
							"dtype": "float32",
							"rate": 0.2,
							"noise_shape": null,
							"seed": null
						}
					},
					{
						"class_name": "GlobalAveragePooling1D",
						"config": {
							"name": "global_average_pooling1d",
							"trainable": true,
							"dtype": "float32",
							"data_format": "channels_last",
							"keepdims": false
						}
					},
					{
						"class_name": "Dropout",
						"config": {
							"name": "dropout_1",
							"trainable": true,
							"dtype": "float32",
							"rate": 0.2,
							"noise_shape": null,
							"seed": null
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense",
							"trainable": true,
							"dtype": "float32",
							"units": 1,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": { "seed": null }
							},
							"bias_initializer": { "class_name": "Zeros", "config": {} },
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					}
				]
			}
		},
		"training_config": {
			"loss": {
				"class_name": "BinaryCrossentropy",
				"config": {
					"reduction": "auto",
					"name": "binary_crossentropy",
					"from_logits": true,
					"label_smoothing": 0.0,
					"axis": -1
				}
			},
			"metrics": [
				[
					{
						"class_name": "BinaryAccuracy",
						"config": {
							"name": "binary_accuracy",
							"dtype": "float32",
							"threshold": 0.0
						}
					}
				]
			],
			"weighted_metrics": null,
			"loss_weights": null,
			"optimizer_config": {
				"class_name": "Custom>Adam",
				"config": {
					"name": "Adam",
					"weight_decay": null,
					"clipnorm": null,
					"global_clipnorm": null,
					"clipvalue": null,
					"use_ema": false,
					"ema_momentum": 0.99,
					"ema_overwrite_frequency": null,
					"jit_compile": true,
					"is_legacy_optimizer": false,
					"learning_rate": 0.0010000000474974513,
					"beta_1": 0.9,
					"beta_2": 0.999,
					"epsilon": 1e-7,
					"amsgrad": false
				}
			}
		}
	},
	"weightsManifest": [
		{
			"paths": ["group1-shard1of1.bin"],
			"weights": [
				{ "name": "dense/kernel", "shape": [16, 1], "dtype": "float32" },
				{ "name": "dense/bias", "shape": [1], "dtype": "float32" },
				{
					"name": "embedding/embeddings",
					"shape": [10001, 16],
					"dtype": "float32"
				}
			]
		}
	]
}
